{
  "crs": "epsg:4326",
  "geometry_field_format": "wkt",
  "name": "my-dataset",
  "profile": "gmns-data-package",
  "profile_version": 0.0,
  "resources": [
    {
      "description": "A link is an edge in a network, defined by the nodes it travels from and to. It may have associated geometry information. Links have three types of attributes:<br>  - Those that define the physical location of the link (e.g., `shape` `information`, `length`, `width`)<br>  - Those that define the link's directionality: `from_node`, `to_node`<br>  - Those that define properties in the direction of travel: capacity, free flow speed, number of lanes, permitted uses, grade, facility type",
      "name": "link",
      "path": "link.csv",
      "required": true,
      "schema": "link.schema.json"
    },
    {
      "description": "A list of vertices that locate points on a map. Typically, they will represent intersections, but may also represent other points, such as a transition between divided and undivided highway. Nodes are the endpoints of a link (as opposed to the other type of vertex, location, which is used to represent points along a link)",
      "name": "node",
      "path": "node.csv",
      "required": true,
      "schema": "node.schema.json"
    },
    {
      "description": "The geometry is an optional file that contains geometry information (shapepoints) for a line object. It is similar to Geometries in the SharedStreets reference system. The specification also allows for geometry information to be stored directly on the link table.",
      "name": "geometry",
      "path": "geometry.csv",
      "schema": "geometry.schema.json"
    },
    {
      "description": "The lane file allocates portions of the physical right-of-way that might be used for travel. It might be a travel lane, bike lane, or a parking lane. Lanes only are included in directed links; undirected links are assumed to have no lane controls or directionality. If a lane is added, dropped, or changes properties along the link, those changes are recorded on the `segment_link` table. Lanes are numbered sequentially, starting at either the centerline (two-way street) or the left shoulder (one-way street or divided highway with two centerlines).",
      "name": "lane",
      "path": "lane.csv",
      "schema": "lane.schema.json"
    },
    {
      "description": "Handles day-of-week and time-of-day restrictions on links",
      "name": "link_tod",
      "path": "link_tod.csv",
      "schema": "link_tod.schema.json"
    },
    {
      "description": "A location is a vertex that is associated with a specific location along a link. Locations may be used to represent places where activities occur (e.g., driveways and bus stops). Its attributes are nearly the same as those for a node, except that the location includes an associated link and node, with location specified as distance along the link from the node.",
      "name": "location",
      "path": "location.csv",
      "schema": "location.schema.json"
    },
    {
      "description": "Describes how inbound and outbound links connect at an intersection.",
      "name": "movement",
      "path": "movement.csv",
      "schema": "movement.schema.json"
    },
    {
      "description": "Handles day-of-week and time-of-day restrictions on movements.",
      "name": "movement_tod",
      "path": "movement_tod.csv",
      "schema": "movement_tod.schema.json"
    },
    {
      "description": "The Use_Definition file defines the characteristics of each vehicle type or non-travel purpose (e.g., a shoulder or parking lane). A two-way left turn lane (TWLTL) is also a use.",
      "name": "use_definition",
      "path": "use_definition.csv",
      "schema": "use_definition.schema.json"
    },
    {
      "description": "Defines groupings of uses, to reduce the size of the allowed_uses lists in the other tables.",
      "name": "use_group",
      "path": "use_group.csv",
      "schema": "use_group.schema.json"
    },
    {
      "description": "The time_set_definitions file is an optional representation of time-of-day and day-of-week sets to enable time restrictions through `_tod` files.",
      "name": "time_set_definitions",
      "path": "time_set_definitions.csv",
      "schema": "time_set_definitions.schema.json"
    },
    {
      "description": "A portion of a link defined by `link_id`,`ref_node_id`, `start_lr`, and `end_lr`. Values in the segment will override they value specified in the link table. When one segment is fully contained within another, its value prevails.",
      "name": "segment",
      "path": "segment.csv",
      "schema": "segment.schema.json"
    },
    {
      "description": "Defines added and dropped lanes, and changes to lane parameters. If a lane is added, it has no parent. If it is changed or dropped, the parent_lane_id field keys to the associated lane on the lane table.",
      "name": "segment_lane",
      "path": "segment_lane.csv",
      "schema": "segment_lane.schema.json"
    },
    {
      "description": "The signal controller is associated with an intersection or a cluster of intersections.",
      "name": "signal_controller",
      "path": "signal_controller.csv",
      "schema": "signal_controller.schema.json"
    },
    {
      "description": "Establishes coordination for several signal controllers, associated with a timing_plan.",
      "name": "signal_coordination",
      "path": "signal_coordination.csv",
      "schema": "signal_coordination.schema.json"
    },
    {
      "description": "Associates Movements and pedestrian Links (e.g., crosswalks) with signal phases. A signal phase may be associated with several movements. A Movement may also run on more than one phase.",
      "name": "signal_phase_mvmt",
      "path": "signal_phase_mvmt.csv",
      "schema": "signal_phase_mvmt.schema.json"
    },
    {
      "description": "For signalized nodes, establishes timing plans.",
      "name": "signal_timing_plan",
      "path": "signal_timing_plan.csv",
      "schema": "signal_timing_plan.schema.json"
    },
    {
      "description": "For signalized nodes, provides signal timing and establishes phases that may run concurrently.",
      "name": "signal_timing_phase",
      "path": "signal_timing_phase.csv",
      "schema": "signal_timing_phase.schema.json"
    },
    {
      "description": "A signal detector is associated with a controller, a phase and a group of lanes.",
      "name": "signal_detector",
      "path": "signal_detector.csv",
      "schema": "signal_detector.schema.json"
    },
    {
      "description": "An optional file that handles day-of-week and time-of-day restrictions on segments. It is used for part-time changes in segment capacity and number of lanes.",
      "name": "segment_tod",
      "path": "segment_tod.csv",
      "schema": "segment_tod.schema.json"
    },
    {
      "description": "An optional file that handles day-of-week and time-of-day restrictions on lanes that traverse entire links.",
      "name": "lane_tod",
      "path": "lane_tod.csv",
      "schema": "lane_tod.schema.json"
    },
    {
      "description": "An optional file that handles day-of-week and time-of-day restrictions on lanes within segments of links.",
      "name": "segment_lane_tod",
      "path": "segment_lane_tod.csv",
      "schema": "segment_lane_tod.schema.json"
    },
    {
      "description": "Locates zones (travel analysis zones, parcels) on a map. Zones are represented as polygons in geographic information systems.",
      "name": "zone",
      "path": "zone.csv",
      "schema": "zone.schema.json"
    }
  ],
  "units": {
    "currency": "cents",
    "enum": [
      {
        "long_length": "mile",
        "name": "us_customary",
        "short_length": "foot",
        "speed": "mile/hour"
      },
      {
        "long_length": "kilometer",
        "name": "si1",
        "short_length": "meter",
        "speed": "kilometer/hour"
      },
      {
        "long_length": "meter",
        "name": "si2",
        "short_length": "meter",
        "speed": "meter/second"
      }
    ],
    "unit_group": "us_customary"
  }
}
